Repository: openstack/manila-ui
Catalog: manila_ui/locale/*/LC_MESSAGES/django.po
Languages: ja, ru, zh_cn

source: Share Type Visibility:
ru: Видимость типа файлового хранилища:

source: "Manage" an existing share from a Manila host. This will make the share visible within OpenStack. <br> <br> This is equivalent to the <tt>'openstack share adopt'</tt> command.
ru: "Управляйте" существующим файловым хранилищем с узла Manila. Это сделает хранилище видимым в OpenStack. <br> <br> Это эквивалентно команде <tt>'openstack share adopt'</tt>.

source: %(used)s of %(quota)s GiB Used
ru: использовано %(used)s из %(quota)s GiB

source: %(used)s of %(quota)s Used
ru: использовано %(used)s из %(quota)s

source: %sGiB
ru: %sГиБ

source: (Quota exceeded)
ja: (クォータを超過しました)
ru: (Превышена квота)
zh_cn: （超过配额）

source: Access Key
ru: Ключ доступа
zh_cn: 访问密钥

source: Access Key:
ru: Ключ доступа:

source: Access Level
ja: アクセスレベル
ru: Уровень доступа
zh_cn: 访问级别

source: Access Level:
ru: Уровень доступа:

source: Access Rules
ru: Правила доступа

source: Access To
ja: 接続先
ru: Доступ к
zh_cn: 访问

source: Access Type
ja: アクセス種別
ru: Тип доступа
zh_cn: 访问类型

source: Access to
ja: 接続先
ru: Доступ к
zh_cn: 访问

source: Access to:
ru: Доступ к:

source: Action
ru: Действие

# Current status of share network
source: Active
ja: 稼働中
ru: Активна
zh_cn: 活动

# Current status of share server
source: Active
ja: 稼働中
ru: Активный
zh_cn: 活动

source: Add
ja: 追加
ru: Добавить
zh_cn: 增加

source: Add Rule
ja: ルールの追加
ru: Добавить правило
zh_cn: 增加规则

source: Add Security Service
ja: セキュリティーサービスの追加
ru: Добавить службу безопасности
zh_cn: 增加安全服务

source: Add Share Snapshot Rule
ru: Добавить снимок правила файлового хранилища

source: Add policy rule to share, 'ip' rule represents IPv4 or IPv6 address, 'user' rule represents username or usergroup, 'cephx' rule represents ceph auth ID.
ru: Добавьте правило политики файлового хранилища, правило "ip" представляет адрес IPv4 или IPv6, правило "user" представляет имя пользователя или группу пользователя, правило "cephx" представляет ID аутентификации ceph.

source: Add policy rule to snapshot, 'ip' rule represents ip address, 'user' rule represents username or usergroup, 'cephx' rule represents ceph auth ID, and 'cert' rule represents certificate.
ru: Добавить правило политики к снимку, правило 'ip' представляет IP-адрес, правило 'user' представляет имя пользователя или группу пользователя, правило "cephx" представляет ID аутентификации ceph, а правило 'cert' представляет сертификат.

source: Add rule
ja: ルールの追加
ru: Добавить правило
zh_cn: 增加规则

source: Add security services to share network.
ja: ファイル共有ネットワークにセキュリティーサービスを追加します。
ru: Добавить службы безопасности в сеть файлового хранилища.
zh_cn: 给共享网络增加安全服务

source: All keys and values must be in range from 1 to 255.
ja: すべてのキーと値は １ から 255 の範囲でなければいけません。
ru: Все ключи и значения должны быть в диапазоне от 1 до 255.
zh_cn: 所有的键和值都必须在1到255之间

source: All pairs that are in field for left are set for this metadata.
ru: Все пары, находящиеся в поле слева установлены для этих метаданных.

source: All pairs that are in field for left are set for this share group type.
ru: Все пары, находящиеся в поле слева, установлены на этот тип группы файлового хранилища.

source: All pairs that are in field for left are set for this share type.
ru: Все пары, находящиеся в поле слева, настроены на этот тип файлового хранилища.

source: Allow project access to share group type.
ru: Разрешить проекту доступ к типу группы файлового хранилища.

source: Allow project access to share type.
ja: ファイル共有種別への接続をプロジェクトに許可します。
ru: Разрешить проекту доступ к типу файлового хранилища.
zh_cn: 允许项目连接到共享类型

source: At least one security service must be specified.
ja: 少なくとも 1 つのセキュリティサービスを指定する必要があります。
ru: По крайней мере одна служба безопасности должна быть определена.
zh_cn: 至少指定一项安全服务

source: At least one share type must be specified.
ru: Необходимо указать хотя бы один тип файлового хранилища.

source: Availability Zone
ja: アベイラビリティーゾーン
ru: Зона доступности
zh_cn: 可用域

source: Availability zone
ru: Зона доступности
zh_cn: 可用区

# Current status of replica
source: Available
ru: Доступна
zh_cn: 可用

# Current status of share
source: Available
ja: 利用可能
ru: Доступно
zh_cn: 可用

# Current status of snapshot
source: Available
ja: 利用可能
ru: Доступен
zh_cn: 可用

source: Available networks
ru: Доступные сети

source: Available projects
ja: 使用可能なプロジェクト
ru: Доступные проекты
zh_cn: 可用项目

source: Available security services
ja: 利用可能なセキュリティーサービス
ru: Доступные службы безопасности
zh_cn: 可用安全服务

source: Cancel
ru: Отмена

source: Cancel Migration
ja: 移行の取り消し
ru: Отменить перенос
zh_cn: 取消迁移

source: Cancel migration
ru: Отменить перенос
zh_cn: 取消迁移

source: Cancel migration of a Share
ja: ファイル共有の移行の取り消し
ru: Отменить перенос файлового хранилища
zh_cn: 取消迁移共享

source: Cancel migration of a migrating share. <br> <br> This is equivalent to the <tt>'openstack share migration cancel'</tt> command.
ru: Отменить перенос переносимого файлового хранилища. <br> <br> Это эквивалентно команде <tt>'openstack share migration cancel'</tt>.

source: Capabilities
ru: Возможности

source: Choose a snapshot
ja: スナップショットを選択してください
ru: Выберите снимок
zh_cn: 选择一个快照

source: Complete Migration
ru: Завершить перенос
zh_cn: 完成迁移

source: Complete migration
ru: Завершить перенос
zh_cn: 完成迁移

source: Complete migration of a Share
ru: Завершить перенос файлового хранилища
zh_cn: 完成共享迁移

source: Complete migration of a migrating share to another Manila host. This operation is expected to be disruptive. <br> <br> This is equivalent to the <tt>'openstack share migration complete'</tt> command.
ru: Завершить перенос переносимого файлового хранилища на другой узел Manila. Ожидается, что эта операция может привести к сбоям в работе. <br> <br> Это эквивалентно команде <tt>'openstack share migration complete'</tt>.

source: Confirm Migration Cancelling of Share
ja: ファイル共有の移行の確認
ru: Подтвердить отмену переноса файлового хранилища
zh_cn: 确认共享迁移的取消

source: Confirm Migration Completion of Share
ru: Подтвердить завершение переноса файлового хранилища
zh_cn: 确认共享迁移的完成

source: Confirm Obtaining migration progress of Share
ru: Подтвердить получение информации о ходе переноса файлового хранилища
zh_cn: 确认获取共享迁移的进度

source: Confirm Password
ja: パスワード（確認）
ru: Подтвердите пароль
zh_cn: 确认密码

source: Create
ja: 作成
ru: Создать
zh_cn: 创建

source: Create Group Share Type
ru: Создать тип группы файлового хранилища

source: Create Replica
ru: Создать реплику
zh_cn: 创建副本

source: Create Security Service
ja: セキュリティーサービスの作成
ru: Создать службу безопасности
zh_cn: 创建安全服务

source: Create Share
ja: ファイル共有の作成
ru: Создать файловое хранилище
zh_cn: 创建共享

source: Create Share Group
ru: Создать группу файлового хранилища

source: Create Share Group Snapshot
ru: Создать снимок группы файлового хранилища

source: Create Share Group Type
ru: Создать тип группы файлового хранилища

source: Create Share Network
ru: Создать сеть файлового хранилища
zh_cn: 创建共享网络

source: Create Share Network Subnet
ru: Создать подсеть файлового хранилища

source: Create Share Replica
ru: Создать реплику файлового хранилища

source: Create Share Snapshot
ja: ファイル共有スナップショットの作成
ru: Создать снимок файлового хранилища
zh_cn: 创建共享快照

source: Create Share Type
ja: ファイル共有種別の作成
ru: Создать тип файлового хранилища
zh_cn: 创建共享类型

source: Create Subnet
ru: Создать подсеть

source: Create a Share
ja: ファイル共有の作成
ru: Создать файловое хранилище
zh_cn: 创建共享

source: Create share replica in specific availability zone.
ru: Создать реплику файлового хранилища в определенной зоне доступности.

source: Created
ru: Создан

source: Created At
ru: Создан в
zh_cn: 创建于

source: Created At:
ru: Создан в:

source: Created at
ru: Создан в

source: Created share network "%s".
ru: Создана сеть файлового хранилища "%s".

# Current status of replica
source: Creating
ru: Создание
zh_cn: 创建中

# Current status of share
source: Creating
ja: 作成中
ru: Создание
zh_cn: 创建中

# Current status of share server
source: Creating
ja: 作成中
ru: Создание
zh_cn: 正在创建

# Current status of snapshot
source: Creating
ja: 作成中
ru: Создание
zh_cn: 正在创建

source: Creating replica for share "%s".
ru: Создание реплики для файлового хранилища "%s".
zh_cn: 为共享"%s".创建副本。

source: Creating rule for "%s"
ja: 「%s」のルールを作成中
ru: Создание правила для "%s"
zh_cn: 为 "%s"创建规则

source: Creating share "%s"
ja: ファイル共有「%s」を作成中
ru: Создание файлового хранилища "%s"
zh_cn: 创建共享"%s"

source: Creating share group "%s"
ru: Создание группы файлового хранилища "%s"

source: Creating share group snapshot "%s".
ru: Создание снимка группы файлового хранилища "%s".

source: Creating share snapshot "%s".
ja: ファイル共有スナップショット "%s" を作成しています。
ru: Создается снимок файлового хранилища "%s".
zh_cn: 创建共享快照"%s"中

source: Creating snapshot rule for "%s"
ru: Создание снимка правила для "%s"
zh_cn: 创建快照规则"%s"

source: Current Size (GiB)
ja: 現在のサイズ (GiB)
ru: Текущий размер (ГиБ)
zh_cn: 当前大小(GiB)

source: Delete Replica
ru: Удалить реплику

source: Delete Rule
ru: Удалить правило

source: Delete Security Service
ja: セキュリティサービスを削除します
ru: Удалить службу безопасности
zh_cn: 删除安全服务

source: Delete Share
ru: Удалить файловое хранилище

source: Delete Share Group
ru: Удалить группу файлового хранилища

source: Delete Share Group Snapshot
ja: 共有グループスナップショットを削除する
ru: Удалить снимок группы файлового хранилища
zh_cn: 删除共享组快照

source: Delete Share Group Type
ru: Удалить тип группы файлового хранилища

source: Delete Share Network
ru: Удалить сеть файлового хранилища

source: Delete Share Server
ru: Удалить сервер файлового хранилища

source: Delete Share Snapshot
ru: Удалить снимок файлового хранилища

source: Delete Share Snapshot Rule
ru: Удалить снимок правила файлового хранилища

source: Delete Share Type
ru: Удалить тип файлового хранилища

source: Delete Snapshot
ru: Удалить снимок

source: Delete User Message
ru: Удалить пользовательское сообщение

source: Deleted Replica
ru: Реплика удалена

source: Deleted Rule
ru: Правило удалено

source: Deleted Security Service
ja: セキュリティサービスを削除しました
ru: Служба безопасности удалена
zh_cn: 删除安全服务

source: Deleted Share
ru: Файловое хранилище удалено

source: Deleted Share Group
ru: Группа файлового хранилища удалена

source: Deleted Share Group Snapshot
ru: Снимок группы файлового хранилища удален

source: Deleted Share Group Type
ru: Тип группы файлового хранилища удален

source: Deleted Share Network
ru: Сеть файлового хранилища удалена

source: Deleted Share Server
ru: Сервер файлового хранилища удален

source: Deleted Share Snapshot
ru: Снимок файлового хранилища удален

source: Deleted Share Snapshot Rule
ru: Снимок правила файлового хранилища удален

source: Deleted Share Type
ru: Тип файлового хранилища удален

source: Deleted Snapshot
ru: Снимок удален

source: Deleted User Message
ru: Пользовательское сообщение удалено

# Current status of replica
source: Deleting
ru: Удаление
zh_cn: 删除中

# Current status of share
source: Deleting
ja: 削除中
ru: Удаление
zh_cn: 删除中

source: Description
ja: 説明
ru: Описание
zh_cn: 描述

source: Description
ru: Описание

source: Description:
ru: Описание:

source: Destination host and pool where share will be migrated to.
ru: Узел назначения и пул, куда будет перенесено файловое хранилище.
zh_cn: 共享迁移到的目的主机和池。

source: Domain
ja: ドメイン
ru: Домен
zh_cn: 域名

source: Driver handles share servers
ja: ファイル共有サーバーを処理するドライバー
ru: Драйвер управляет серверами файлового хранилища
zh_cn: 共享服务器

source: Driver options ('volume_id' for Generic driver, etc...)
ja: ドライバーオプション（Genericドライバーの「volume_id」、など）
ru: Параметры драйвера ("volume_id" для универсального драйвера и т. д.)
zh_cn: Driver选项（例如,设置'volume_id'为Generic driver）

source: Duplicated keys '%s'.
ja: キー「%s」が重複しています
ru: Повторяющиеся ключи '%s'.
zh_cn: 复制密钥'%s'

source: Edit
ja: 編集
ru: Изменить
zh_cn: 编辑

source: Edit Rule Metadata
ru: Изменить метаданные правила

source: Edit Security Service
ja: セキュリティーサービスの編集
ru: Изменить службу безопасности
zh_cn: 编辑安全服务

source: Edit Share
ja: ファイル共有の編集
ru: Изменить файловое хранилище
zh_cn: 编辑共享

source: Edit Share Metadata
ja: ファイル共有のメタデータの編集
ru: Изменить метаданные файлового хранилища
zh_cn: 编辑共享元数据

source: Edit Share Network
ru: Изменить сеть файлового хранилища
zh_cn: 编辑共享网络

source: Edit Share Snapshot
ru: Изменить снимок файлового хранилища

source: Edit Share network
ru: Изменить сеть файлового хранилища

source: Enforces migration of the share snapshots to the destination. If set to True, host-assisted migration will not be attempted.
ru: Принудительно переносит снимки файлового хранилища в место назначения. Если установлено значение True, попытка переноса с помощью узла не будет выполнена.
zh_cn: 强制共享快照迁移到目的地。如果为True，主机辅助迁移将不会尝试。

source: Enforces migration to be nondisruptive. If set to True, host-assisted migration will not be attempted.
ru: Обеспечивает бесперебойный перенос. Если установлено значение True, попытки переноса с помощью узла выполняться не будут.
zh_cn: 强制迁移不干扰。如果设置为True，将不尝试主机辅助迁移。

source: Enforces migration to keep the share writable while contents are being moved. If set to True, host-assisted migration will not be attempted.
ru: Принудительно выполняет перенос, сохраняя возможность записи в файловое хранилище во время перемещения содержимого. Если установлено значение True, попытка переноса с помощью узла не будет выполнена.
zh_cn: 当内容被移动时，强制迁移保持共享可写。如果为True，主机辅助迁移将不会尝试。

source: Enforces migration to preserve all file metadata when moving its contents. If set to True, host-assisted migration will not be attempted.
ru: Обеспечивает сохранение всех метаданных файла при перемещении его содержимого. Если установлено значение True, попытка переноса с помощью узла выполняться не будет.
zh_cn: 当移动它的内容时，强制迁移保留所有文件元数据。如果为True，主机辅助迁移将不会尝试。

source: Enforces the use of the host-assisted migration approach, which bypasses driver optimizations.
ru: Обеспечивает использование подхода к переносу с помощью узла, который обходит оптимизацию драйверов.
zh_cn: 强制使用主机辅助迁移方法，绕过驱动最优参数。

# Current status of replica
source: Error
ru: Ошибка
zh_cn: 错误

# Current status of share
source: Error
ja: エラー
ru: Ошибка
zh_cn: 错误

# Current status of share network
source: Error
ja: エラー
ru: Ошибка
zh_cn: 错误

# Current status of share server
source: Error
ja: エラー
ru: Ошибка
zh_cn: 错误

# Current status of snapshot
source: Error
ja: エラー
ru: Ошибка
zh_cn: 错误

source: Expected only pairs of key=value.
ja: キー=値のペアのみ設定できます。
ru: Ожидаются только пары ключ=значение.
zh_cn: 只支持键值对的方式key=value

source: Expires at
ru: Истекает в

source: Export location
ja: エクスポート場所
ru: Расположение экспорта
zh_cn: 导入位置

source: Export location of share. Example for NFS: 1.2.3.4:/path/to/share
ja: ファイル共有のエクスポート場所。NFSの例: 1.2.3.4:/path/to/share
ru: Расположение экспортируемого файлового хранилища. Пример для NFS: 1.2.3.4:/path/to/share
zh_cn: 导入共享的位置。例如，NFS: 1.2.3.4:/path/to/share

source: Export locations
ru: Расположения экспорта

# Current status of share
source: Extending Error
ja: 拡張中のエラー
ru: Ошибка расширения
zh_cn: 扩展错误

source: Extra Spec
ru: Дополнительные параметры

source: Extra spec 'driver_handles_share_servers' is required and should have boolean value.
ru: Требуется дополнительный параметр 'driver_handles_share_servers', который должен иметь логическое значение (bool).

source: Extra spec 'driver_handles_share_servers' is required and should have boolean value.
ru: Требуется дополнительный параметр 'driver_handles_share_servers', который должен иметь логическое значение (bool).

source: Extra specs
ja: 追加スペック
ru: Дополнительные параметры
zh_cn: 额外规范

source: Force Host Assisted Migration
ru: Принудительный перенос с помощью узла
zh_cn: 强制主机协助迁移

source: From here you can modify name and description of a security service.
ru: Здесь вы можете изменить название и описание службы безопасности.

source: From here you can modify name and description of a share group snapshot.
ru: Здесь вы можете изменить имя и описание снимка группы файлового хранилища.

source: From here you can modify name and description of a share network.
ru: Здесь вы можете изменить название и описание сети файлового хранилища.

source: From here you can modify name and description of a snapshot.
ru: Здесь вы можете изменить имя и описание снимка.

source: From here you can modify name, description and visibility of a share group.
ru: Здесь вы можете изменить имя, описание и видимость группы файлового хранилища.

source: From here you can modify name, description and visibility of a share.
ru: Здесь вы можете изменить название, описание и видимость файлового хранилища.

source: From here you can modify name, description, extra specs and visibility of a share type.
ru: Здесь вы можете изменить название, описание, дополнительные параметры и видимость типа файлового хранилища.

source: From here you can revert the share to its latest snapshot.
ru: Здесь вы можете вернуть файловое хранилище к его последнему снимку.

source: From here you can update share network info.
ja: ここから、ファイル共有ネットワーク情報を更新できます。
ru: Здесь вы можете обновить информацию о сети файлового хранилища.
zh_cn: 您可在此处更新共享网络信息。

source: From here you can update the default share quotas (max limits).
ru: Здесь вы можете обновить квоты файлового хранилища по умолчанию (максимальные лимиты).

source: Get Migration Progress
ru: Получить ход переноса

source: Get migration progress
ru: Получить ход переноса
zh_cn: 获取迁移进度

source: Got improper value for field 'driver_options'. Expected only pairs of key=value.
ja: フィールド「driver_options」に不適切な値があります。キー=値のペアのみ設定できます。
ru: Получено неверное значение для поля 'driver_options'. Ожидались только пары ключ=значение.
zh_cn: 'driver_options'设置了不正确的值。只支持键值对的方式key=value

source: Group specs
ru: Параметры группы

source: Here can be modified extra specs for share type.
ru: Здесь можно изменить дополнительные параметры для типа файлового хранилища.

source: Here can be modified group specs for share group type.
ru: Здесь можно изменить параметры группы для типа группы файлового хранилища.

source: Host
ja: ホスト
ru: Узел
zh_cn: 主机

source: Host of share
ja: ファイル共有のホスト
ru: Узел файлового хранилища
zh_cn: 共享主机

source: Host to migrate share
ru: Узел для переноса файлового хранилища
zh_cn: 选择要迁移的主机。

source: Host where share is located, example: some.host@driver[#pool]
ja: ファイル共有が配置されるホスト。例: some.host@driver[#pool]
ru: Узел, на котором находится файловое хранилище, например: some.host@driver[#pool]
zh_cn: 共享服务所处的主机，比如some.host@driver[#pool]

source: Improper value set to required extra spec 'spec_driver_handles_share_servers'. Allowed values are %s. Case insensitive.
ja: 必須の追加のスペック「spec_driver_handles_share_servers」に不適切な値が設定されました。%s が使用できます。 大文字小文字を区別しません。
ru: Для требуемого дополнительного параметра 'spec_driver_handles_share_servers' установлено недопустимое значение. Допустимые значения: %s. Регистр не учитывается.
zh_cn: 额外规范中'spec_driver_handles_share_servers'的值设置的不正确。允许的值为%s。不区分大小写

# Current status of share server
source: In-use
ja: 使用中
ru: Используется
zh_cn: 正在使用

# Current status of snapshot
source: In-use
ja: 使用中
ru: Используется
zh_cn: 正在使用

# Current status of share network
source: Inactive
ja: 非稼働
ru: Неактивна
zh_cn: 失效

source: Is admin only:
ru: Только для администратора:

source: Is default
ru: По умолчанию

source: Key '%s' has improper length.
ru: Ключ '%s' имеет неподходящую длину.
zh_cn: 密钥'%s'长度不符合要求

source: Key can not contain spaces. See string '%s'.
ja: キーに空白は使えません。「%s」を確認してください。
ru: Ключ не может содержать пробелы. См. строку '%s'.
zh_cn: 密钥不能包含空格。参看字符串'%s'。

source: Keys should not contain spaces. Error in '%s'.
ja: キーに空白は使えません。「%s」にエラーがあります。
ru: Ключи не должны содержать пробелов. Ошибка в '%s'.
zh_cn: 密钥不能包含空格。'%s'中存在错误

source: Limit
ru: Ограничение

source: Make visible to users from all projects
ru: Сделать видимым для пользователей всех проектов

source: Manage
ja: 管理
ru: Управление
zh_cn: 管理

# Current status of share
source: Manage Error
ja: 管理エラー
ru: Ошибка регистрации
zh_cn: 管理错误

source: Manage Replicas
ru: Управление репликами
zh_cn: 管理副本

source: Manage Rules
ja: ルールの管理
ru: Управление правилами
zh_cn: 管理规则

source: Manage Share
ja: ファイル共有の管理
ru: Управление файловым хранилищем
zh_cn: 管理共享

source: Manage Share Group Type Access
ru: Управление доступом к типу группы файлового хранилища

source: Manage Share Snapshot Rules
ru: Управление снимком правил файлового хранилища

source: Manage Share Type Access
ja: ファイル共有種別の接続の管理
ru: Управлять доступом к типу файлового хранилища
zh_cn: 管理共享类型的访问权限

source: Message
ru: Сообщение

source: Message Level
ru: Уровень сообщения

source: Metadata
ja: メタデータ
ru: Метаданные
zh_cn: 元数据

source: Migrate Share
ru: Перенос файлового хранилища
zh_cn: 共享迁移

source: Migrate a Share
ja: ファイル共有の移行
ru: Перенести файловое хранилище
zh_cn: 迁移共享

source: Migrate an existing share to another Manila host. This will move all your share data from one host to another. <br> <br> This is equivalent to the <tt>'openstack share migration start'</tt> command.
ru: Перенести существующее файловое хранилище на другой узел Manila. Это перенесёт все данные Вашего файлового хранилища с одного узла на другой. <br> <br> Это эквивалентно команде <tt>'openstack share migration start'</tt>.

# Current status of share
source: Migrating
ru: Перенос
zh_cn: 迁移中

# Current status of share
source: Migrating to
ru: Перенос в
zh_cn: 正在迁移至

source: Migration of share %(name)s is at %(progress)s percent.
ru: Файловое хранилище %(name)s перенесено на %(progress)s процентов.
zh_cn: 共享%(name)s已迁移百分之%(progress)s。

source: Mount snapshot support
ru: Поддержка монтирования снимка

source: Name
ja: 名前
ru: Имя
zh_cn: 名称

source: Name
ru: Имя

source: Name:
ru: Имя:

source: Network handling enabled:
ru: Сетевая обработка включена:

source: Networks
ja: ネットワーク
ru: Сети
zh_cn: 网络

source: Neutron Net
ja: Neutron ネットワーク
ru: Сеть Neutron
zh_cn: Neutron网络

source: Neutron Network
ru: Сеть Neutron

source: Neutron Subnet
ja: Neutron サブネット
ru: Подсеть Neutron
zh_cn: Neutron子网

source: New Size (GiB)
ja: 新しいサイズ (GiB)
ru: Новый размер (ГиБ)
zh_cn: 新大小(GiB)

source: New share network to be set in migrated share
ru: Новая сеть файлового хранилища будет установлена в перенесенное файловое хранилище
zh_cn: 在迁移共享中，设置新的共享网络

source: New share type to be set in migrating share
ru: Новый тип файлового хранилища, который будет установлен при переносе файлового хранилища
zh_cn: 在迁移共享中设置共享类型

source: New size must be different than the existing size
ru: Новый размер должен отличаться от существующего размера

source: New size should not be less than or equal to zero
ru: Новый размер не должен быть меньше или равен нулю

source: No projects found.
ja: プロジェクトが見つかりませんでした。
ru: Проекты не найдены.
zh_cn: 没有找到任何项目

source: No projects selected.
ja: どのプロジェクトも選択されていません。
ru: Проекты не выбраны.
zh_cn: 为选择任何项目

source: No security services found.
ja: セキュリティサービスがありません。
ru: Службы безопасности не найдены.
zh_cn: 未发现安全服务

source: No security services selected.
ja: セキュリティサービスが選択されていません。
ru: Службы безопасности не выбраны.
zh_cn: 未选择安全服务

source: No source, empty share
ja: ソースの指定なし (空のファイル共有)
ru: Нет источника, пустое файловое хранилище
zh_cn: 没有源，空的共享

source: No source, empty share group
ru: Нет источника, пустая группа файлового хранилища

source: Nondisruptive
ru: Непрерываемый
zh_cn: 不干扰

source: None
ru: Нет

source: Number of Share Snapshots
ru: Количество снимков файлового хранилища

source: Number of Shares
ru: Количество файловых хранилищ

source: Obtain Progress
ru: Получить информацию о ходе переноса
zh_cn: 获取进度

source: Obtain migration progress of a Share
ru: Получить информацию о ходе переноса файлового хранилища
zh_cn: 获取共享迁移的进度

source: Obtains migration progress of a migrating share. <br> <br> This is equivalent to the <tt>'openstack share migration show'</tt> command.
ru: Получает ход переноса переносимого файлового хранилища. <br> <br> Это эквивалентно команде <tt>'openstack share migration show'</tt>.
