Repository: openstack/manila-ui
Catalog: manila_ui/locale/*/LC_MESSAGES/django.po
Languages: ja, ru, zh_cn

source: Unable to obtain progress of migration of share %s at this moment.
ru: В данный момент невозможно получить ход переноса файлового хранилища %s.
zh_cn: 当前无法获得共享%s的迁移进度。

source: Unable to reset state of replica '%s'.
ru: Не удалось сбросить состояние реплики '%s'.
zh_cn: 无法重置副本'%s'的状态。

source: Unable to reset status of replica '%s'.
ru: Не удалось сбросить статус реплики '%s'.
zh_cn: 无法重置副本'%s'的状态。

source: Unable to reset status of share group '%s'.
ru: Не удалось сбросить статус группы файлового хранилища '%s'.

source: Unable to reset status of share group snapshot '%s'.
ja: 共有グループスナップショット'%s'の状態をリセットできません
ru: Не удалось сбросить статус снимка группы файлового хранилища '%s'.
zh_cn: 无法重置共享组快照'%s'的状态

source: Unable to resize share.
ru: Не удалось изменить размер файлового хранилища.

source: Unable to resize share.
ru: Не удалось изменить размер файлового хранилища.

source: Unable to resync replica '%s'.
ru: Не удалось синхронизировать реплику '%s'.
zh_cn: 无法重新同步副本 '%s'。

source: Unable to retrieve default share quotas.
ru: Не удалось получить квоты файлового хранилища по умолчанию.

source: Unable to retrieve details of replica %s
ru: Не удалось получить подробности реплики %s

source: Unable to retrieve list of projects.
ja: プロジェクトの一覧を取得できません。
ru: Не удалось получить список проектов.
zh_cn: 无法检索项目列表

source: Unable to retrieve messages list.
ru: Не удалось получить список сообщений.

source: Unable to retrieve quotas.
ja: クォータを取得できません。
ru: Не удалось получить квоты.
zh_cn: 无法检索配额

source: Unable to retrieve replica '%s'.
ru: Не удалось получить реплику '%s'.
zh_cn: 无法检索副本'%s'。

source: Unable to retrieve security service '%s' details.
ja: セキュリティーサービス「%s」の詳細を取得できません。
ru: Не удалось получить подробности службы безопасности '%s'.
zh_cn: 无法检索安全服务详情'%s'

source: Unable to retrieve security services
ja: セキュリティーサービスの一覧を取得できません
ru: Не удалось получить службы безопасности
zh_cn: 无法检索安全服务

source: Unable to retrieve security_service.
ja: セキュリティサービスを取得できません。
ru: Не удалось получить службу безопасности.
zh_cn: 无法检索安全服务

source: Unable to retrieve share %s.
ru: Не удалось получить файловое хранилище %s.

source: Unable to retrieve share access rule.
ru: Не удалось получить правило доступа файлового хранилища.

source: Unable to retrieve share details.
ja: ファイル共有の詳細を取得できません。
ru: Не удалось получить подробности файлового хранилища.
zh_cn: 无法检索共享详情

source: Unable to retrieve share group '%s'.
ru: Не удалось получить группу файлового хранилища '%s'.

source: Unable to retrieve share group details.
ru: Не удалось получить подробности группы файлового хранилища.

source: Unable to retrieve share group snapshot '%s'.
ru: Не удалось получить снимок группы файлового хранилища '%s'.

source: Unable to retrieve share group snapshot details.
ru: Не удалось получить подробности снимка группы файлового хранилища.

source: Unable to retrieve share group snapshot list.
ru: Не удалось получить список снимков группы файлового хранилища.

source: Unable to retrieve share group snapshot.
ru: Не удалось получить снимок группы файлового хранилища.

source: Unable to retrieve share group snapshots.
ru: Не удалось получить снимки группы файлового хранилища.

source: Unable to retrieve share group type.
ru: Не удалось получить тип группы файлового хранилища.

source: Unable to retrieve share group types.
ru: Не удалось получить типы группы файлового хранилища.

source: Unable to retrieve share group.
ru: Не удалось получить группу файлового хранилища.

source: Unable to retrieve share groups.
ru: Не удалось получить группы файлового хранилища.

source: Unable to retrieve share instance details.
ja: ファイル共有インスタンスの詳細を取得できません。
ru: Не удалось получить подробности инстанса файлового хранилища.
zh_cn: 无法检索共享实例详情

source: Unable to retrieve share instances.
ja: ファイル共有インスタンスの一覧を取得できません
ru: Не удалось получить инстансы файлового хранилища.
zh_cn: 无法检索共享实例

source: Unable to retrieve share limit information.
ja: ファイル共有のリソース上限情報を取得できません。
ru: Не удалось получить информацию по ограничениям файлового хранилища.
zh_cn: 无法检索共享限制信息

source: Unable to retrieve share list.
ja: ファイル共有の一覧を取得できません。
ru: Не удалось получить список файлового хранилища.
zh_cn: 无法检索共享列表

source: Unable to retrieve share network details.
ru: Не удалось получить подробности сети файлового хранилища.
zh_cn: 无法检索共享网络详情

source: Unable to retrieve share network.
ja: ファイル共有ネットワークを取得できません。
ru: Не удалось получить сеть файлового хранилища.
zh_cn: 无法检索共享网络

source: Unable to retrieve share networks
ja: ファイル共有ネットワークの一覧を取得できません
ru: Не удалось получить сети файлового хранилища
zh_cn: 无法检索共享网络

source: Unable to retrieve share quotas.
ru: Не удалось получить квоты файлового хранилища.

source: Unable to retrieve share replicas.
ru: Не удалось получить реплики файлового хранилища.
zh_cn: 无法检索共享副本

source: Unable to retrieve share rules.
ja: ファイル共有ルールの一覧を取得できません。
ru: Не удалось получить правила файлового хранилища.
zh_cn: 无法检索共享规则

source: Unable to retrieve share server details.
ja: ファイル共有サーバーの詳細を取得できません。
ru: Не удалось получить подробности сервера файлового хранилища.
zh_cn: 无法检索共享服务器详情

source: Unable to retrieve share servers
ja: ファイル共有サーバーの一覧を取得できません
ru: Не удалось получить серверы файлового хранилища
zh_cn: 无法检索共享服务器

source: Unable to retrieve share snapshot list.
ru: Не удалось получить список снимков файлового хранилища.

source: Unable to retrieve share snapshot rules.
ru: Не удалось получить снимок правил файлового хранилища.

source: Unable to retrieve share snapshot.
ru: Не удалось получить снимок файлового хранилища.

source: Unable to retrieve share snapshots list.
ja: ファイル共有スナップショットの一覧を取得できません。
ru: Не удалось получить список снимков файлового хранилища.
zh_cn: 无法检索共享快照列表

source: Unable to retrieve share snapshots.
ja: ファイル共有スナップショットの一覧を取得できません。
ru: Не удалось получить снимки файлового хранилища.
zh_cn: 无法检索共享快照

source: Unable to retrieve share type.
ru: Не удалось получить тип файлового хранилища.

source: Unable to retrieve share types.
ru: Не удалось получить типы файлового хранилища.

source: Unable to retrieve share.
ja: ファイル共有を取得できません。
ru: Не удалось получить файловое хранилище.
zh_cn: 无法检索共享

source: Unable to retrieve snapshot details.
ja: スナップショットの詳細を取得できません。
ru: Не удалось получить подробности снимка.
zh_cn: 无法检索快照详情

source: Unable to retrieve snapshot.
ja: スナップショットを取得できません。
ru: Не удалось получить снимок.
zh_cn: 无法检索快照

source: Unable to retrieve user message detail.
ru: Не удалось получить подробности пользовательского сообщения.

source: Unable to retrieve volume details.
ja: ボリュームの詳細を取得できません。
ru: Не удалось получить подробности диска.
zh_cn: 无法检索卷详情

source: Unable to revert share to the snapshot.
ru: Не удалось вернуть файловое хранилище к снимку.

source: Unable to set replica '%s' as active.
ru: Не удалось установить реплику '%s' активной.
zh_cn: 无法设置副本'%s'状态为active。

source: Unable to update access for share group type "%s".
ru: Не удалось обновить доступ для типа группы файлового хранилища "%s".

source: Unable to update access for share type "%s".
ja: ファイル共有種別「%s」の接続を更新できません。
ru: Не удалось обновить доступ для типа файлового хранилища "%s".
zh_cn: 无法更新共享类型"%s"的访问权限

source: Unable to update default quotas.
ja: 標準のクォータを更新できません。
ru: Не удалось обновить квоты по умолчанию.
zh_cn: 无法更新默认配额

source: Unable to update group specs for share group type.
ru: Не удалось обновить параметры группы для типа группы файлового хранилища.

source: Unable to update rule metadata.
ru: Не удалось обновить метаданные правила.

source: Unable to update security service.
ja: セキュリティーサービスを更新できません。
ru: Не удалось обновить службу безопасности.
zh_cn: 无法更新安全服务

source: Unable to update share group snapshot.
ru: Не удалось обновить снимок группы файлового хранилища.

source: Unable to update share group type.
ru: Не удалось обновить тип группы файлового хранилища.

source: Unable to update share group.
ru: Не удалось обновить группу файлового хранилища.

source: Unable to update share metadata.
ja: ファイル共有のメタデータを更新できません。
ru: Не удалось обновить метаданные файлового хранилища.
zh_cn: 无法更新共享元数据

source: Unable to update share network "%s".
ja: ファイル共有ネットワーク「%s」を更新できません。
ru: Не удалось обновить сеть файлового хранилища "%s".
zh_cn: 无法更新共享网络 "%s"

source: Unable to update share network.
ja: ファイル共有ネットワークを更新できません。
ru: Не удалось обновить сеть файлового хранилища.
zh_cn: 无法更新共享网络

source: Unable to update share snapshot.
ru: Не удалось обновить снимок файлового хранилища.

source: Unable to update share type.
ja: ファイル共有種別を更新できません。
ru: Не удалось обновить тип файлового хранилища.
zh_cn: 无法更新共享类型

source: Unable to update share.
ja: ファイル共有を更新できません。
ru: Не удалось обновить файловое хранилище.
zh_cn: 无法更新共享

source: Unknown
ja: 不明
ru: Неизвестно
zh_cn: 未知

source: Update
ja: 更新
ru: Обновить
zh_cn: 更新

source: Update Share Group
ru: Обновить группу файлового хранилища

source: Update Share Group Snapshot
ru: Обновить снимок группы файлового хранилища

source: Update Share Group Type
ru: Обновить тип группы файлового хранилища

source: Update Share Network
ru: Обновить сеть файлового хранилища
zh_cn: 更新共享网络

source: Update Share Snapshot
ru: Обновить снимок файлового хранилища

source: Update Share Type
ja: ファイル共有種別の更新
ru: Обновить тип файлового хранилища
zh_cn: 更新共享类型

source: Update Share group Type
ru: Обновить тип группы файлового хранилища

source: Update share network
ru: Обновить сеть файлового хранилища

source: Updated
ru: Обновлено

source: Updated At
ru: Обновлен в
zh_cn: 更新于

source: Updated At:
ru: Обновлен в:

source: Updated access for share group type "%s".
ru: Обновлен доступ для типа группы файлового хранилища "%s".

source: Updated access for share type "%s".
ja: ファイル共有種別「%s」の接続を更新しました。
ru: Обновлен доступ для типа файлового хранилища "%s".
zh_cn: 更新共享类型"%s"的访问权限

source: Updated share network "%s".
ja: ファイル共有ネットワーク「%s」を更新しました。
ru: Обновлена сеть файлового хранилища "%s".
zh_cn: 更新共享网络"%s"

source: Updating share "%s"
ja: ファイル共有 "%s" を更新中
ru: Обновление файлового хранилища "%s"
zh_cn: 正在更新共享 "%s"

source: Updating share access rule metadata
ru: Обновление метаданных правила доступа файлового хранилища

source: Updating share group "%s"
ru: Обновление группы файлового хранилища "%s"

source: Updating share group snapshot "%s"
ru: Обновление снимка группы файлового хранилища "%s"

source: Updating share metadata "%s"
ja: ファイル共有のメタデータ "%s" を更新中
ru: Обновление метаданных файлового хранилища "%s"
zh_cn: 正在更新共享元数据 "%s"

source: Updating share network "%s"
ja: ファイル共有ネットワーク「%s」を更新しています
ru: Обновление сети файлового хранилища "%s"
zh_cn: 更新共享网络"%s"

source: Updating share snapshot "%s"
ru: Обновление снимка файлового хранилища "%s"

source: Use share group snapshot as a source
ru: Использовать снимок группы файлового хранилища в качестве источника

source: Use snapshot as a source
ja: スナップショットをソースとして使用する
ru: Использовать снимок как источник
zh_cn: 使用快照作为源

source: User
ja: ユーザー
ru: Пользователь
zh_cn: 用户

source: User Message
ru: Пользовательское сообщение

source: User Message Details: %(message_id)s
ru: Подробности пользовательского сообщения: %(message_id)s

source: User Messages
ru: Пользовательские сообщения

source: User Messages Detail
ru: Подробности пользовательских сообщений

source: User Messages Details
ru: Подробности пользовательских сообщений

source: User Messages Overview
ru: Обзор пользовательских сообщений

source: Visibility
ja: 公開範囲
ru: Видимость
zh_cn: 可见性

source: Writable
ru: Доступно для записи
zh_cn: 可写入的

source: as Active?
ru: активным?

source: key=value pairs per line can be set
ja: 「キー=値」のペアを行ごとに設定できます
ru: Можно задать пары ключ=значение для каждой строки
zh_cn: 每一行设置键值对

source: Confirm Unmanage Share
ja: ファイル共有の管理解除の確認
zh_cn: 确认取消管理共享

source: DNS IP
zh_cn: DNS IP地址

source: Extend
ja: 拡張
zh_cn: 扩展

source: Extend Share
ja: ファイル共有の拡張
zh_cn: 扩展共享

source: Extend share "%s"
ja: ファイル共有「%s」の拡張
zh_cn: 扩展共享 "%s"

source: IP Version
ja: IP バージョン
zh_cn: IP版本

source: Make visible for all
ja: 全ユーザーに公開する
zh_cn: 对所有人可见

source: Network Type
ja: ネットワーク種別
zh_cn: 网络类型

source: New size must be greater than current size.
ja: 変更後のサイズは現在のサイズより大きくなければいけません。
zh_cn: 新大小必须大于当前大小

source: Nova Net
ja: Nova ネットワーク
zh_cn: Nova网络

source: Segmentation Id
ja: セグメント ID
zh_cn: 分段ID

source: Share Server Id
ja: ファイル共有サーバー ID
zh_cn: 共享服务器Id

source: Shares Networks
zh_cn: 共享网络

source: Successfully sent the request to unmanage share: %s
ja: ファイル共有 %s の管理解除要求は正常に行われました。
zh_cn: 已成功发送取消管理卷 %s 的请求

source: Successfully updated extra specs for share type '%s'.
ja: ファイル共有種別「%s」の追加スペックの更新に成功しました。
zh_cn: 成功更新共享类型的额外规范'%s'

source: Unable to extend share.
ja: ファイル共有を拡張できません。
zh_cn: 无法扩展共享

source: Unable to retrieve replica %sdetails.
zh_cn: 无法检索副本%s详情。

source: Unable to retrieve share. %s
zh_cn: 无法检索共享。%s

source: Unable to retrieve share_type.
ja: ファイル共有種別を取得できません。
zh_cn: 无法检索共享类型

source: Unable to unmanage share.
ja: ファイル共有の管理を解除できません。
zh_cn: 无法取消管理共享

source: Unable to update extra_specs for share type.
ja: ファイル共有種別の追加スペックを更新できません。
zh_cn: 无法更新共享类型的额外规范

source: Unmanage
ja: 管理解除
zh_cn: 取消管理

# Current status of share
source: Unmanage Error
ja: 管理解除エラー
zh_cn: 取消管理错误

source: Unmanage Share
ja: ファイル共有の管理解除
zh_cn: 取消管理共享
