Repository: openstack/manila-ui
Catalog: manila_ui/locale/*/LC_MESSAGES/django.po
Languages: ja, ru, zh_cn

source: One line - one action. Empty strings will be ignored.
ru: Одна строка - одно действие. Пустые строки будут игнорироваться.

source: Organizational Unit
ru: Организационная единица

source: Overview
ja: 概要
ru: Обзор
zh_cn: 概览

source: Password
ja: パスワード
ru: Пароль
zh_cn: 密码

source: Passwords do not match.
ja: パスワードが一致しません。
ru: Пароли не совпадают.
zh_cn: 密码不匹配

source: Path:
ru: Путь:

source: Placeholder for description of share group type access managing form.
ru: Поле для описания формы управления доступом к типу группы файлового хранилища.

source: Placeholder for description of share type access managing form.
ru: Поле для описания формы управления доступом к типу файлового хранилища.

source: Preferred:
ru: Предпочтительно:

source: Preserve Metadata
ru: Сохранить метаданные
zh_cn: 保护元数据

source: Preserve Snapshots
ru: Сохранить снимки
zh_cn: 保留快照

source: Project
ja: プロジェクト
ru: Проект
zh_cn: 项目

source: Project ID
ru: ID проекта

source: Projects with access to share group type
ru: Проекты с доступом к типу группы файлового хранилища

source: Projects with access to share type
ja: ファイル共有種別に接続するプロジェクト
ru: Проекты с доступом к типу файлового хранилища
zh_cn: 项目访问分享类型

source: Protocol
ja: プロトコル
ru: Протокол
zh_cn: 协议

source: Public
ja: パブリック
ru: Публичный
zh_cn: 公有

source: Quota Name
ru: Имя квоты

source: Replica Details
ru: Подробности реплики

source: Replica Details: %(replica_display_name)s
ru: Подробности реплики: %(replica_display_name)s
zh_cn: 副本详情：%(replica_display_name)s

source: Replica State
ru: Состояние реплики
zh_cn: 副本状态

source: Replica state
ru: Состояние реплики

source: Replicas
ru: Реплики
zh_cn: 副本

source: Request ID
ru: ID запроса

source: Reset Replica State
ru: Сбросить состояние реплики
zh_cn: 重置副本状态

source: Reset Replica Status
ru: Сбросить статус реплики
zh_cn: 重置副本状态

source: Reset Share Group Snapshot Status
ru: Сброс статуса снимка группы файлового хранилища

source: Reset Share Group Status
ru: Сбросить статус группы файлового хранилища

source: Reset Status
ru: Сбросить статус

source: Reset replica state
ru: Сбросить состояние реплики
zh_cn: 重置副本状态

source: Reset replica status
ru: Сбросить статус реплики
zh_cn: 重置副本状态

source: Reset share replica's state with ID
ru: Сбросить состояние реплики файлового хранилища с ID

source: Reset share replica's status with ID
ru: Сбросить статус реплики файлового хранилища с ID

source: Reset state
ru: Сбросить состояние
zh_cn: 重置状态

source: Reset status
ru: Сбросить статус
zh_cn: 重置状态

source: Reseting replica ('%(id)s') state from '%(from)s' to '%(to)s'.
ru: Сброс состояния реплики ('%(id)s') с '%(from)s' на '%(to)s'.
zh_cn: 正在重置副本 ('%(id)s') 状态从'%(from)s'到 '%(to)s'。

source: Reseting replica ('%(id)s') status from '%(from)s' to '%(to)s'.
ru: Сброс статуса реплики ('%(id)s') с '%(from)s' на '%(to)s'.
zh_cn: 重置副本 ('%(id)s') 状态从'%(from)s'到 '%(to)s'。

source: Reseting share group ('%(id)s') status from '%(from)s' to '%(to)s'.
ru: Сброс статуса группы файлового хранилища ('%(id)s') с '%(from)s' на '%(to)s'.

source: Reseting share group snapshot ('%(id)s') status from '%(from)s' to '%(to)s'.
ja: 共有グループスナップショット ('%(id)s')状態を '%(from)s' から '%(to)s'へリセットします
ru: Сброс статуса снимка группы файлового хранилища ('%(id)s') с '%(from)s' на '%(to)s'.
zh_cn: 重置共享组快照('%(id)s') 状态从'%(from)s'至'%(to)s'

source: Resize
ru: Изменить размер

source: Resize Share
ru: Изменить размер файлового хранилища

source: Resize the size of a share.
ru: Изменить размер файлового хранилища.

source: Resized share "%s"
ru: Изменён размер файлового хранилища "%s"

source: Resource ID
ru: ID ресурса

source: Resource Type
ru: Тип ресурса

source: Resync
ru: Повторная синхронизация
zh_cn: 重新同步

source: Resync Replica
ru: Повторная синхронизация реплики
zh_cn: 重新同步副本

source: Resync replica
ru: Повторная синхронизация реплики
zh_cn: 重新同步副本

source: Resync share replica with ID
ru: Повторно синхронизировать реплику файлового хранилища с ID

source: Resync'ing replica '%s'
ru: Синхронизация реплики '%s'
zh_cn: 重新同步副本'%s'

source: Revert Share
ru: Вернуть файловое хранилище

source: Revert Share to a Snapshot
ru: Вернуть файловое хранилище к снимку

source: Revert share to a snapshot
ru: Вернуть файловое хранилище к снимку

# Current status of share
source: Reverting Error
ru: Ошибка возврата

source: Rules
ja: ルール
ru: Правила
zh_cn: 规则

source: Save Changes
ja: 変更の保存
ru: Сохранить изменения
zh_cn: 保存变更

source: Security Service Details
ru: Подробности службы безопасности

source: Security Service Details: %(service_display_name)s
ja: セキュリティサービスの詳細: %(service_display_name)s
ru: Подробности службы безопасности: %(service_display_name)s
zh_cn: 安全服务详情: %(service_display_name)s

source: Security Service Overview
ja: セキュリティサービス概要
ru: Обзор службы безопасности
zh_cn: 安全服务概览

source: Security Services
ja: セキュリティーサービス
ru: Службы безопасности
zh_cn: 安全服务

source: Security services within share network
ja: ファイル共有ネットワーク内のセキュリティーサービス
ru: Службы безопасности в сети файлового хранилища
zh_cn: 共享网络内的安全服务

source: Select parameters of share group you want to create.
ru: Выберите параметры группы файлового хранилища, которые вы хотите создать.

source: Select parameters of share you want to create.
ru: Выберите параметры файлового хранилища, который вы хотите создать.

source: Selected Networks
ru: Выбранные сети

source: Selected Projects
ru: Выбранные проекты

source: Selected projects
ja: 選択済みのプロジェクト
ru: Выбранные проекты
zh_cn: 选择项目

source: Selected security services
ja: 選択済みのセキュリティーサービス
ru: Выбранные службы безопасности
zh_cn: 选择安全服务

source: Server
ja: サーバー
ru: Сервер
zh_cn: 主机

source: Set Replica as Active
ru: Установить реплику активной
zh_cn: 设置副本状态为Active

source: Set as Active
ru: Установить активной
zh_cn: 设置为Active

source: Set maximum quotas for the project.
ja: このプロジェクトの最大クォータを設定します。
ru: Установить максимальные квоты для проекта.
zh_cn: 为项目设置最大配额

source: Set share replica with ID
ru: Установить реплику файлового хранилища с ID

source: Setting replica "%s" as active...
ru: Установка реплики "%s" как активной...
zh_cn: 设置副本"%s"状态为active。。。

source: Share
ja: ファイル共有
ru: Файловое хранилище
zh_cn: 共享

source: Share "%(s)s" has been reverted to "%(ss)s" snapshot successfully
ru: Файловое хранилище "%(s)s" было успешно возвращено к снимку "%(ss)s"

source: Share Details
ru: Подробности файлового хранилища

source: Share Details: %(share_display_name)s
ja: ファイル共有の詳細: %(share_display_name)s
ru: Подробности файлового хранилища: %(share_display_name)s
zh_cn: 共享详情: %(share_display_name)s

source: Share Details: %(share_name)s
ja: ファイル共有の詳細: %(share_name)s
ru: Подробности файлового хранилища: %(share_name)s
zh_cn: 共享详情: %(share_name)s

source: Share Group
ru: Группа файлового хранилища

source: Share Group Details
ru: Подробности группы файлового хранилища

source: Share Group Details: %s
ru: Подробности группы файлового хранилища: %s

source: Share Group Name
ru: Имя группы файлового хранилища

source: Share Group Overview
ru: Обзор группы файлового хранилища

source: Share Group Snapshot
ru: Снимок группы файлового хранилища

source: Share Group Snapshot Details
ru: Подробности снимка группы файлового хранилища

source: Share Group Snapshot Details: %(sgs_display_name)s
ru: Подробности снимка группы файлового хранилища: %(sgs_display_name)s

source: Share Group Snapshot Overview
ru: Обзор снимка группы файлового хранилища

source: Share Group Snapshots
ja: 共有グループスナップショット
ru: Группа снимков файлового хранилища
zh_cn: 共享组快照

source: Share Group Type
ru: Тип группы файлового хранилища

source: Share Group Type ID:
ru: ID типа группы файлового хранилища:

source: Share Group Type Name:
ru: Имя типа группы файлового хранилища:

source: Share Group Type Specs:
ru: Параметры типа группы файлового хранилища:

source: Share Group Types
ru: Типы группы файлового хранилища

source: Share Groups
ru: Группы файлового хранилища

source: Share ID
ja: ファイル共有 ID
ru: ID файлового хранилища
zh_cn: 共享ID

source: Share Instance Details
ru: Подробности инстанса файлового хранилища

source: Share Instance Details: %s
ja: ファイル共有インスタンスの詳細: %s
ru: Подробности инстанса файлового хранилища: %s
zh_cn: 共享实例详情: %s

source: Share Instance Overview
ru: Обзор инстанса файлового хранилища

source: Share Instances
ja: ファイル共有インスタンス
ru: Инстансы файлового хранилища
zh_cn: 共享实例

source: Share Limits
ru: Ограничения файлового хранилища

source: Share Name
ja: ファイル共有名
ru: Имя файлового хранилища
zh_cn: 共享名称

source: Share Network
ja: ファイル共有ネットワーク
ru: Сеть файлового хранилища
zh_cn: 共享网络

source: Share Network Details
ru: Подробности сети файлового хранилища

source: Share Network Details: %(network_display_name)s
ru: Подробности сети файлового хранилища: %(network_display_name)s
zh_cn: 共享网络详情: %(network_display_name)s

source: Share Network ID
ru: ID сети файлового хранилища

source: Share Network Info
ru: Информация о сети файлового хранилища
zh_cn: 共享网络信息

source: Share Network Overview
ru: Обзор сети файлового хранилища

source: Share Networks
ja: ファイル共有ネットワーク
ru: Сети файлового хранилища
zh_cn: 共享网络

source: Share Overview
ru: Обзор файлового хранилища

source: Share Protocol
ja: ファイル共有プロトコル
ru: Протокол файлового хранилища
zh_cn: 共享协议

source: Share Quotas
ru: Квоты файлового хранилища

source: Share Replica ID:
ru: ID реплики файлового хранилища:

source: Share Replica Overview
ru: Обзор реплики файлового хранилища

source: Share Replicas
ru: Реплики файлового хранилища

source: Share Replicas: %(share_display_name)s
ru: Реплики файлового хранилища: %(share_display_name)s
zh_cn: 共享副本： %(share_display_name)s

source: Share Rules
ru: Правила файлового хранилища

source: Share Rules: %(share_display_name)s
ja: ファイル共有ルール: %(share_display_name)s
ru: Правила файлового хранилища: %(share_display_name)s
zh_cn: 共享规则: %(share_display_name)s

source: Share Server
ja: ファイル共有サーバー
ru: Сервер файлового хранилища
zh_cn: 共享服务器

source: Share Server Details
ru: Подробности сервера файлового хранилища

source: Share Server Details: %(server_name)s
ja: ファイル共有サーバーの詳細: %(server_name)s
ru: Подробности сервера файлового хранилища: %(server_name)s
zh_cn: 共享服务器详情: %(server_name)s

source: Share Server ID
ru: ID сервера файлового хранилища

source: Share Server Overview
ru: Обзор сервера файлового хранилища

source: Share Servers
ja: ファイル共有サーバー
ru: Серверы файлового хранилища
zh_cn: 共享服务器

source: Share Snapshot Details
ru: Подробности снимка файлового хранилища

source: Share Snapshot Name
ru: Имя снимка файлового хранилища

source: Share Snapshot Overview
ru: Обзор снимка файлового хранилища

source: Share Snapshot Rules
ru: Снимок правил файлового хранилища

source: Share Snapshot gigabytes
ru: Снимок файлового хранилища, гигабайт

source: Share Snapshots
ja: ファイル共有のスナップショット
ru: Снимки файлового хранилища
zh_cn: 共享快照

source: Share Snapshots Storage
ja: ファイル共有のスナップショットストレージ
ru: Хранилище снимков файлового хранилища
zh_cn: 共享快照存储

source: Share Snapshots are used for storing share changes and creating shares.
ru: Снимки файлового хранилища используются для хранения изменений файлового хранилища и создания файловых хранилищ.

source: Share Source
ja: ファイル共有ソース
ru: Источник файлового хранилища
zh_cn: 共享源

source: Share Storage
ja: ファイル共有のストレージ
ru: Хранилище файлового хранилища
zh_cn: 共享存储

source: Share Type
ja: ファイル共有種別
ru: Тип файлового хранилища
zh_cn: 共享类型

source: Share Type Name:
ru: Имя типа файлового хранилища:

source: Share Type Visibility:
ru: Видимость типа файлового хранилища:

source: Share Types
ja: ファイル共有種別
ru: Типы файлового хранилища
zh_cn: 共享类型

source: Share Types (multiple available)
ru: Типы файлового хранилища (доступно несколько)

source: Share Types (one available)
ru: Типы файлового хранилища (доступен один)

source: Share cannot be extended to %(req)iGiB as you only have %(avail)iGiB of your quota available.
ja: ファイル共有を %(req)iGiB に拡張することができません。利用できるクォータは %(avail)iGiB しかありません。
ru: Файловое хранилище не может быть расширено до %(req)iGiB, поскольку вам доступно только %(avail)iGiB от вашей квоты.
zh_cn: 共享不能扩展到 %(req)iGiB，因为您的可用配额只有 %(avail)iGiB。

source: Share gigabytes
ru: Файловое хранилище, гигабайт

source: Share name to be assigned
ja: 割り当てらるファイル共有名
ru: Имя файлового хранилища, которое будет присвоено
zh_cn: 指定分享名称

source: Share network
ru: Сеть файлового хранилища

source: Share networks contain network data, that will be used for creation of service VM, where will be hosted shares.
ru: Сети файлового хранилища содержат сетевые данные, которые будут использоваться для создания служебной виртуальной машины, на которой будут размещаться файловые хранилища.

source: Share replica %s has been deleted.
ru: Реплика файлового хранилища %s была удалена.
zh_cn: 共享副本'%s'已经被删除。

source: Share server
ru: Сервер файлового хранилища

source: Share size must be equal to or greater than the snapshot size (%sGiB)
ja: ファイル共有サイズはスナップショットサイズ (%sGiB) 以上でなければいけません。
ru: Размер файлового хранилища должен быть равным или больше размера снимка (%sГиБ)
zh_cn: 分享大小必须等于或者大于快照大小(%sGiB)

source: Share snapshot gigabytes
ru: Снимки файлового хранилища, гигабайт

source: Share snapshots
ru: Снимки файлового хранилища

source: Share type
ru: Тип файлового хранилища

source: Share types
ru: Типы файлового хранилища

source: Shared Quotas
ru: Квоты файлового хранилища

source: Shares
ja: ファイル共有
ru: Файловые хранилища
zh_cn: 共享

source: Shares on this server
ru: Файловые хранилища на этом сервере

# Current status of share
source: Shrinking Error
ru: Ошибка сжатия

source: Size
ja: サイズ
ru: Размер
zh_cn: 大小

source: Size (GiB)
ja: サイズ (GiB)
ru: Размер (ГиБ)
zh_cn: 大小(GiB)

source: Snapshot
ja: スナップショット
ru: Снимок
zh_cn: 快照

source: Snapshot Details: %(snapshot_display_name)s
ja: スナップショットの詳細: %(snapshot_display_name)s
ru: Подробности снимка: %(snapshot_display_name)s
zh_cn: 快照详情: %(snapshot_display_name)s

source: Snapshot ID
ru: ID снимка

source: Snapshot Overview
ja: スナップショットの概要
ru: Обзор снимка
zh_cn: 快照概览

source: Snapshot Replica ID:
ru: ID реплики снимка:

source: Snapshot Rules: %(snapshot_display_name)s
ru: Снимок правил: %(snapshot_display_name)s
zh_cn: 快照规则：%(snapshot_display_name)s

source: Source
ja: ソース
ru: Источник
zh_cn: 源

source: Source SG Snapshot
ru: Снимок источника группы файлового хранилища

source: Source Share Group
ru: Группа источника файлового хранилища

source: Source Share Group Snapshot
ru: Снимок источника группы файлового хранилища

source: Source Type
ru: Тип источника

source: Source share group snapshot
ru: Снимок источника группы файлового хранилища

source: Specify an Availability Zone or an existing subnet. If no details are specified, then a default subnet with a null Availability Zone will be created automatically.
ru: Укажите зону доступности или существующую подсеть. Если данные не указаны, будет автоматически создана подсеть по умолчанию с отсутствующей зоной доступности.

source: Specify the new share network for the share. Do not specify this parameter if the migrating share has to be retained within its current share network.
ru: Укажите новую общую сеть для файлового хранилища. Не указывайте этот параметр, если переносимое файловое хранилище необходимо сохранить в текущей сети файлового хранилища.
zh_cn: 为共享指定新的共享网络。如果迁移共享被保留在它的当前共享网络时，不要指定这参数。

source: Specify the new share type for the share. Do not specify this parameter if the migrating share has to be retained with its current share type.
ru: Укажите новый тип файлового хранилища для файлового хранилища. Не указывайте этот параметр, если переносимое файловое хранилище необходимо сохранить с текущим типом файлового хранилища.
zh_cn: 为共享指定新的共享类型。如果迁移共享被保留在它的当前共享类型时，不要指定这个参数。

source: Specs
ru: Параметры

source: Start migration
ru: Начать перенос
zh_cn: 开始迁移

source: Status
ja: ステータス
ru: Статус
zh_cn: 状态

source: Status:
ru: Статус:

source: Submit
ru: Отправить

source: Subnet
ru: Подсеть

source: Subnets
ru: Подсети

source: Successfully created security service: %s
ja: セキュリティーサービス %s を正常に作成しました。
ru: Успешно создана служба безопасности: %s
zh_cn: 成功创建安全服务%s

source: Successfully created share group type: %s
ru: Успешно создан тип группы файлового хранилища: %s

source: Successfully created share network subnet for: %s
ru: Успешно создана подсеть файлового хранилища для: %s

source: Successfully created share network: %s
ja: ファイル共有ネットワークが正常に作成されました: %s
ru: Успешно создана сеть файлового хранилища: %s
zh_cn: 成功创建共享网络%s

source: Successfully created share type: %s
ja: ファイル共有種別が正常に作成されました: %s
ru: Успешно создан тип файлового хранилища: %s
zh_cn: 创建共享类型%s成功

source: Successfully sent the request to cancel migration of share: %s.
ru: Успешно отправлен запрос на отмену переноса файлового хранилища: %s.
zh_cn: 成功发送取消共享: %s迁移的请求。

source: Successfully sent the request to complete migration of share: %s.
ru: Успешно отправлен запрос на завершение переноса файлового хранилища: %s.
zh_cn: 成功发送完成共享迁移: %s的请求。

source: Successfully sent the request to manage share: %s
ja: ファイル共有 %s の管理要求は正常に行われました。
ru: Успешно отправлен запрос на управление файловым хранилищем: %s
zh_cn: 已成功发送管理卷 %s 的请求

source: Successfully sent the request to migrate share: %s.
ru: Успешно отправлен запрос на перенос файлового хранилища: %s.
zh_cn: 已成功发送迁移共享: %s的请求。

source: Successfully updated group specs for share group type '%s'.
ru: Успешно обновлены параметры для типа группы файлового хранилища '%s'.

source: Successfully updated security service "%s"
ja: セキュリティーサービス %s を正常に更新しました
ru: Успешно обновлена служба безопасности "%s"
zh_cn: 成功更新安全服务"%s"

source: Successfully updated share type '%s'.
ru: Успешно обновлен тип файлового хранилища '%s'.

source: Task state
ru: Состояние задачи

source: The operation timed out while resizing. Please try again.
ru: Время ожидания операции при изменении размера истекло. Пожалуйста, попробуйте ещё раз.

source: The security service can be used by backend drivers to configure clients, for more secure using of share.
ru: Служба безопасности может использоваться драйверами бэкенда для настройки клиентов с целью более безопасного использования файлового хранилища.

source: The share group type defines the characteristics of a share group backend.
ru: Тип группы файлового хранилища определяет характеристики бэкенда группы файлового хранилища.

source: The share size cannot be less than the snapshot size (%sGiB)
ja: ファイル共有サイズはスナップショットサイズ (%sGiB) 未満にはできません。
ru: Размер файлового хранилища не может быть меньше размера снимка (%sГиБ)
zh_cn: 共享大小不能小于快照大小(%sGiB)

source: The share type defines the characteristics of a share backend.
ru: Тип файлового хранилища определяет характеристики бэкенда файлового хранилища.

source: To add extra specs use:
ru: Чтобы добавить дополнительные параметры, используйте:

source: To add extra-specs use:
ru: Для добавления дополнительных параметров используйте:

source: To add group specs use:
ru: Чтобы добавить параметры группы, используйте:

source: To add group-specs use:
ru: Чтобы добавить параметры группы, используйте:

source: To add metadata use:
ru: Для добавления метаданных используйте:

source: To unset extra specs use:
ru: Чтобы сбросить дополнительные параметры, используйте:

source: To unset group specs use:
ru: Чтобы сбросить параметры группы, используйте:

source: To unset metadata use:
ru: Чтобы сбросить метаданные, используйте:

source: Total Gibibytes
ru: Всего гибибайт

source: Type
ja: 種別
ru: Тип
zh_cn: 类型

source: Unable to add rule.
ja: ルールを追加できません。
ru: Не удалось добавить правило.
zh_cn: 无法增加规则

source: Unable to add snapshot rule.
ru: Не удалось добавить снимок правила.
zh_cn: 不能添加快照规则。

source: Unable to cancel migration of share %s at this moment.
ru: В данный момент невозможно отменить перенос файлового хранилища %s.
zh_cn: 当前无法取消共享%s的迁移。

source: Unable to complete migration of share %s.
ru: Не удалось завершить перенос файлового хранилища %s.
zh_cn: 无法完成共享: %s的迁移。

source: Unable to create security service.
ja: セキュリティーサービスを作成できません。
ru: Не удалось создать службу безопасности.
zh_cn: 无法创建安全服务

source: Unable to create share %s.
ru: Не удалось создать файловое хранилище %s.

source: Unable to create share group snapshot.
ru: Не удалось создать снимок группы файлового хранилища.

source: Unable to create share group type.
ru: Не удалось создать тип группы файлового хранилища.

source: Unable to create share group.
ru: Не удалось создать группу файлового хранилища.

source: Unable to create share network "%s".
ru: Не удалось создать сеть файлового хранилища "%s".

source: Unable to create share network subnet.
ru: Не удалось создать подсеть файлового хранилища.

source: Unable to create share network.
ja: ファイル共有ネットワークを作成できません。
ru: Не удалось создать сеть файлового хранилища.
zh_cn: 无法创建共享网络

source: Unable to create share replica.
ru: Не удалось создать реплику файлового хранилища.
zh_cn: 无法创建共享副本。

source: Unable to create share snapshot.
ja: ファイル共有スナップショットを作成できません。
ru: Не удалось создать снимок файлового хранилища.
zh_cn: 无法创建共享快照

source: Unable to create share type.
ja: ファイル共有種別を作成できません。
ru: Не удалось создать тип файлового хранилища.
zh_cn: 无法创建共享类型

source: Unable to create share.
ja: ファイル共有を作成できません。
ru: Не удалось создать файловое хранилище.
zh_cn: 无法创建共享

source: Unable to delete message "%s"
ru: Не удалось удалить сообщение "%s"

source: Unable to delete replica "%s".
ru: Не удалось удалить реплику "%s".
zh_cn: 无法删除副本'%s'。

source: Unable to delete rule "%s".
ja: ルール「%s」を削除できません。
ru: Не удалось удалить правило "%s".
zh_cn: 无法删除规则 "%s"

source: Unable to delete share "%s".
ja: ファイル共有 「%s」を削除できません。
ru: Не удалось удалить файловое хранилище "%s".
zh_cn: 无法删除共享 "%s"

source: Unable to delete share group snapshot "%s". One or more share groups depend on it.
ru: Не удалось удалить снимок группы файлового хранилища "%s". От него зависят одна или несколько групп файлового хранилища.
zh_cn: 无法删除共享组快照"%s"，至少一个共享组与其存在依赖关系

source: Unable to delete snapshot "%s". One or more shares depend on it.
ja: スナップショット「%s」は削除できません。 １ つ以上のファイル共有が依存しています。
ru: Не удалось удалить снимок "%s". От него зависят одно или несколько файловых хранилищ.
zh_cn: 无法删除快照"%s"。一个或多个共享正在使用

source: Unable to delete snapshot rule "%s".
ru: Не удалось удалить снимок правила файлового хранилища "%s".
zh_cn: 不能删除快照规则"%s"。

source: Unable to get information about share group type access.
ru: Не удалось получить информацию о доступе к типу группы файлового хранилища.

source: Unable to get information about share type access.
ja: ファイル共有種別の接続に関する情報を取得できません。
ru: Не удалось получить информацию о доступе к типу файлового хранилища.
zh_cn: 无法获得共享类型访问信息

source: Unable to get list of projects.
ja: プロジェクトの一覧を取得できません
ru: Не удалось получить список проектов.
zh_cn: 无法获得项目列表

source: Unable to get manila default quota.
ru: Не удалось получить квоту manila по умолчанию.

source: Unable to get the security services hosts
ja: セキュリティーサービスのホストを取得できません。
ru: Не удалось получить узлы служб безопасности
zh_cn: 无法获得安全服务主机

source: Unable to get the specified share group '%s' for snapshot creation.
ru: Не удалось получить указанную группу файлового хранилища "%s" для создания снимка.

source: Unable to initialize neutron networks.
ru: Не удалось инициализировать сети neutron.

source: Unable to initialize neutron subnets.
ru: Не удалось инициализировать подсети neutron.

source: Unable to load the specified share group snapshot.
ru: Не удалось загрузить указанный снимок группы файлового хранилища.

source: Unable to load the specified snapshot.
ja: 指定されたスナップショットを読み込めません。
ru: Не удалось загрузить указанный снимок.
zh_cn: 无法加载指定快照

source: Unable to manage share
ja: ファイル共有を管理できません。
ru: Не удалось управлять файловым хранилищем
zh_cn: 无法管理共享

source: Unable to migrate share %s.
ru: Не удалось перенести файловое хранилище %s.
zh_cn: 无法迁移共享%s。
