Repository: openstack/manila-ui
Catalog: releasenotes/source/locale/*/LC_MESSAGES/releasenotes.po
Languages: ru

source: "snapshot_support" is no longer automatically included as an extra-spec in share types created via manila-ui. If the share type has to match backends that support snapshots, explicitly specify "snapshot_support" in the "Extra specs" field while creating share types. This change does not modify pre-existing share types.
ru: "snapshot_support" больше не включается автоматически в качестве дополнительного параметра в типы файлового хранилища, создаваемые через manila-ui. Если тип файлового хранилища должен соответствовать бэкендам, поддерживающим снимки, явно укажите "snapshot_support" в поле "Дополнительные параметры" при создании типов файлового хранилища. Это изменение не влияет на существующие типы файлового хранилища.

source: 2023.1 Series Release Notes
ru: Примечания к выпуску 2023.1

source: 2023.2 Series Release Notes
ru: Примечания к выпуску 2023.2

source: 2024.1 Series Release Notes
ru: Примечания к выпуску 2024.1

source: 2024.2 Series Release Notes
ru: Примечания к выпуску 2024.2

source: 2025.1 Series Release Notes
ru: Примечания к выпуску 2025.1

source: Add share network subnet create option under share network actions.
ru: Добавлена опция создания подсети файлового хранилища в разделе действий сети файлового хранилища.

source: Added access metadata for share access and also introduced the GET /share-access-rules API.
ru: Добавлены метаданные доступа к файловому хранилищу, а также представлен API GET /share-access-rules.

source: Added filter search by extra spec for share type list.
ru: Добавлен фильтр поиска по дополнительным параметрам для списка типа файлового хранилища.

source: Added native protocol for MapRFS manila share driver
ru: Добавлен собственный протокол для драйвера файлового хранилища MapRFS Manila

source: Added possibility to create share type with description.
ru: Добавлена ​​возможность создания типа файлового хранилища с описанием.

source: Added possibility to revert share to its latest snapshot.
ru: Добавлена ​​возможность отката файлового хранилища к его последнему снимку.

source: Added preserve-snapshots option to share migration.
ru: Добавлена опция preserve-snapshots для переноса файлового хранилища.

source: Added support for the mountable snapshots feature to manila-ui.
ru: Добавлена поддержка функции монтируемых снимков в manila-ui.

source: Added the possibility to filter share networks by their name or description.
ru: Добавлена возможность фильтровать сети файлового хранилища по их имени или описанию.

source: Added ‘is_default’ field to share types list. the Is_default Column will show 'Yes' if the share type is default share type.
ru: Добавлено поле ‘is_default’ в список типов файлового хранилища. В столбце ‘is_default’ будет отображаться значение 'Yes', если тип файлового хранилища является типом по умолчанию.

source: Added ‘ou’ field to ‘security_service’ object. Additionally added options to update dns_ip, ou, server, domain, password and user fields.
ru: Добавлено поле ‘ou’ в объект ‘security_service’. Также добавлены возможности обновления полей dns_ip, ou, server, domain, password и user.

source: Adds ‘is_default’ field to share group types list. the Is_default Column will show 'Yes' if the share group type is default share group type.
ru: Добавлено поле ‘is_default’ в список типов группы файлового хранилища. В столбце ‘is_default’ будет отображаться значение 'Yes', если тип группы файлового хранилища является типом по умолчанию.

source: Admin dashboard now has manila-specific panel group called 'share'. All 'tabs' we had before are panels in this group now. Each panel is loaded in separate page. It allows us to avoid making redundant API calls that we did loading all tabs at once.
ru: В панели администратора теперь есть специальная группа панели под названием 'файловое хранилище'. Все 'вкладки', которые были раньше, теперь являются панелями в этой группе. Каждая панель загружается на отдельной странице. Это позволяет нам избежать лишних вызовов API, которые мы делали при одновременной загрузке всех вкладок.

source: Availability zone field is now shown for both public and private shares in the dashboard showing detailed share information.
ru: Поле 'зона доступности' теперь отображается как для общедоступных, так и для частных файловых хранилищ в панели управления, где отображается подробная информация о файловом хранилище.

source: Bug Fixes
ru: Исправления ошибок

source: Current Series Release Notes
ru: Примечания к текущему выпуску

source: Drop the ``host`` field from project view tables since this information is only visible to administrators. This is the UI side of `Launchpad bug 1664370 <https://bugs.launchpad.net/manila/+bug/1664370>`_ and completes the fix for that bug.
ru: Удалено поле ``host`` из таблиц просмотра проектов, поскольку эта информация видна только администраторам. Это касается пользовательского интерфейса `ошибка 1664370 <https://bugs.launchpad.net/manila/+bug/1664370>`_ и завершает исправление этой ошибки.

source: Existing "Extend Share" feature in Manila-UI was renamed "Resize Share" and share shrinking feature was added. Now users can both extend and shrink shares.
ru: Существующая функция "расширить файловое хранилище" в Manila-UI была переименована в "изменить размер файлового хранилища" и была добавлена функция уменьшения файлового хранилища. Теперь пользователи могут как расширять, так и уменьшать файловые хранилища.

source: Fixed Manage Replicas button availability.
ru: Исправлена доступность кнопки 'управление репликами'.

source: Fixed a bug where share group could not be created from share group snapshot. `Launchpad bug <https://bugs.launchpad.net/manila-ui/+bug/2090947>`_
ru: Исправлена ошибка, из-за которой не удавалось создать группу файлового хранилища из снимка группы файлового хранилища. `Ошибка Launchpad <https://bugs.launchpad.net/manila-ui/+bug/2090947>`_

source: Fixed an issue when share type with 'dhss=True' option and dash in the type name doesn't enable 'Share Network' widget at 'Create Share' form.
ru: Исправлена проблема, при которой тип файлового хранилище с параметром 'dhss=True' и тире в названии типа не активировало виджет 'сеть файлового хранилища' в форме 'создать файловое хранилище'.

source: Fixed an issue where an error message popped up about not being able to retrieve share network details when an ordinary user attempted to see these because the user wasn't authorized for certain admin-only ``share server`` information. In this circumstance we now handle this situation gracefully behind the scenes and display all the share network information for which the end user is authorized.
ru: Исправлена проблема, при которой появлялось сообщение об ошибке о невозможности получить подробности сети файлового хранилища, когда пользователь пытался их просмотреть, поскольку он не имел прав доступа к определенной информации о ``сервере файлового хранилища``, доступной только администраторам. Теперь в такой ситуации мы корректно обрабатываем эту ситуацию в фоновом режиме и отображаем всю информацию о сети файлового хранилища, к которой конечный пользователь имеет доступ.

source: Fixed an issue while trying to load share types that had boolean extra specs when RBAC was enabled. For more details, please refer to `Launchpad bug <https://bugs.launchpad.net/manila-ui/+bug/2004165>`_
ru: Исправлена проблема при попытке загрузить типы файлового хранилища, имеющие дополнительные параметры типа boolean, когда был включен RBAC. Для получения более подробной информации см. `ошибку Launchpad <https://bugs.launchpad.net/manila-ui/+bug/2004165>`_

source: Fixed error in share creation caused by internal UnicodeDecodeError. `Launchpad bug #2043572 <https://bugs.launchpad.net/manila-ui/+bug/2043572>`_
ru: Исправлена ошибка при создании файлового хранилища, вызванная внутренней ошибкой UnicodeDecodeError. `Launchpad ошибка #2043572 <https://bugs.launchpad.net/manila-ui/+bug/2043572>`_

source: Fixed error in share creation caused by internal UnicodeDecodeError. `Launchpad bug <https://bugs.launchpad.net/manila-ui/+bug/2043572>`_
ru: Исправлена ошибка при создании файлового хранилища, вызванная внутренней ошибкой UnicodeDecodeError. `Ошибка Launchpad <https://bugs.launchpad.net/manila-ui/+bug/2043572>`_

source: Fixed form of share creation from snapshot. Before it was losing source snapshot ID in request and was creating share from scratch instead of expected snapshot-sourced variant.
ru: Исправлена форма создания файлового хранилища из снимка. Ранее в запросе терялся ID исходного снимка и файловое хранилище создавалось с нуля, а не из ожидаемого варианта на основе снимка.

source: Fixed issue that the saved Share quota data is not shown in Modify Quotas modal dialog.
ru: Исправлена ​​ошибка, из-за которой сохраненные данные квоты файлового хранилища не отображались в модальном диалоговом окне 'Изменить квоты'.

source: Fixed missing "Create Share" button on the "Shares" dashboard.
ru: Исправлена ошибка, из-за которой в панели управления "Файловые хранилища" отсутствовала кнопка "Создать файловое хранилище".

source: Fixed quota names overlapping with Cinder's quotas. Now it is possible to read/write any manila quotas not messing up Cinder's quotas.
ru: Исправлены названия квоты, дублирующие названия квот Cinder. Теперь можно читать/записывать любые квоты Manila, не нарушая квоты Cinder.

source: IPv6 access rules can now be added to shares.
ru: Теперь к файловым хранилищам можно добавлять правила доступа IPv6.

source: Implements the user messages graphical interface for the project and admin dashboards. [`blueprint ui-user-messages <https://blueprints.launchpad.net/manila-ui/+spec/ui-user-messages>`_]
ru: Реализован графический интерфейс пользовательских сообщений для панелей управления проектами и администрирования. [`blueprint ui-user-messages <https://blueprints.launchpad.net/manila-ui/+spec/ui-user-messages>`_]

source: New Features
ru: Новые возможности

source: Newton Series Release Notes
ru: Примечания к выпуску Newton

source: Now the minimum python version supported is 3.9 .
ru: Теперь минимальная поддерживаемая версия python - 3.9.

source: Ocata Series Release Notes
ru: Примечания к выпуску Ocata

source: Pike Series Release Notes
ru: Примечания к выпуску Pike

source: Project dashboard now has manila-specific panel group called 'share'. All 'tabs' we had before are panels in this group now. Each panel is loaded in separate page. It allows us to avoid making redundant API calls that we did loading all tabs at once.
ru: На панели управления проектом теперь есть специальная группа панелей под названием 'файловое хранилище'. Все 'вкладки', которые были раньше, теперь являются панелями в этой группе. Каждая панель загружается на отдельной странице. Это позволяет нам избежать лишних вызовов API, которые мы делали при одновременной загрузке всех вкладок.

source: Python 2.7 support has been dropped. The last release of openstack/manila-ui to support py2.7 is OpenStack Train (2.19.x). The minimum version of Python now supported by openstack/manila-ui is Python 3.6.
ru: Поддержка Python 2.7 была прекращена. Последней версией openstack/manila-ui, поддерживающей py2.7, является OpenStack Train (2.19.x). Минимальная версия Python, поддерживаемая в настоящее время openstack/manila-ui - Python 3.6.

source: Queens Series Release Notes
ru: Примечания к выпуску Queens

source: Rocky Series Release Notes
ru: Примечания к выпуску Rocky

source: Share servers are added to the share network details page. The page has been modified to show share servers and security services only if any exist, or are retrievable from the server.
ru: Серверы файлового хранилища добавлены на страницу подробностей сети файлового хранилища. Страница была изменена таким образом, что теперь на ней отображаются серверы файлового хранилища и службы безопасности только в том случае, если они существуют или могут быть получены с сервера.

source: Started using release notes to track changes to manila UI.
ru: Начато использование примечаний к выпуску для отслеживания изменений в пользовательском интерфейсе Manila.

source: Stein Series Release Notes
ru: Примечания к выпуску Stein

source: Support for Python 3.9 has been removed. Now Python 3.10 is the minimum version supported.
ru: Поддержка Python 3.9 была удалена. Теперь минимальной поддерживаемой версией является Python 3.10.

source: Support for nova networking has been removed. Manila and the manilaclient sdk dropped support for nova network in the Ocata release (Feb 2017). So this should not have an impact on deployers running later releases, and this note is only informational.
ru: Поддержка сети nova была удалена. Manila и manilaclient sdk отказались от поддержки сети nova в версии Ocata (февраль 2017 года). Это не должно повлиять на пользователей, использующих более поздние версии, данное примечание носит исключительно информационный характер.

source: Switched share network creation to a two-step workflow. We now allow configuring an availability zone with the initial network subnet associated with the share network. Share network detail panels have been updated accordingly as well
ru: Создание сети файлового хранилища переведено на двухэтапный процесс. Теперь можно настроить зону доступности с исходной подсетью, связанной с сетью файлового хранилища. Панели с подробностями сети файлового хранилища также были обновлены соответствующим образом.

source: The Share replica details page has been fixed to render correctly for users with non-admin roles.
ru: Страница подробностей реплики файлового хранилища была исправлена ​​для корректного отображения для пользователей с ролями, отличными от административных.

source: The ``name``, ``description`` and/or ``share_type_access:is_public`` attributes of share types can be updated with API version ``2.50`` and beyond.
ru: Атрибуты ``name``, ``description`` и/или ``share_type_access:is_public`` типов файлового хранилища можно обновить с помощью API версии ``2.50`` и выше.

source: The default configuration file has been updated and now includes the required parameters to use the new policy-in-code feature in Horizon. Please refer to the release note and documentation of Horizon to find details about this feature.
ru: Файл конфигурации по умолчанию был обновлён и теперь включает необходимые параметры для использования новой функции 'политики в коде' в Horizon. Подробнее об этой функции см. в примечаниях к выпуску и документации Horizon.

source: The share groups dashboards now show the share group availability zone, share group type details and share group capabilities.
ru: Панели управления группами файлового хранилища теперь отображают зону доступности группы файлового хранилища, подробности типа группы файлового хранилища и возможности группы файлового хранилища.

source: This change updates the Manila API version to 2.33. This means that users can have access to timestamp details in access rules, available since API v2.33
ru: Это изменение обновляет API Manila до версии 2.33. Это означает, что пользователи смогут получать доступ к информации о временных метках в правилах доступа, доступных начиная с API версии 2.33.

source: This version of manila-ui requires `python-manilaclient >= 1.29.0 <https://docs.openstack.org/releasenotes/python-manilaclient/train.html#relnotes-1-29-0-stable-train>`_
ru: Для этой версии manila-ui требуется `python-manilaclient >= 1.29.0 <https://docs.openstack.org/releasenotes/python-manilaclient/train.html#relnotes-1-29-0-stable-train>`_

source: This version of manila-ui requires `python-manilaclient >= 2.7.0 <https://docs.openstack.org/releasenotes/python-manilaclient/xena.html#relnotes-2-7-0-stable-xena>`_
ru: Для этой версии manila-ui требуется `python-manilaclient >= 2.7.0 <https://docs.openstack.org/releasenotes/python-manilaclient/xena.html#relnotes-2-7-0-stable-xena>`_

source: Train Series Release Notes
ru: Примечания к выпуску Train

source: URLs for resources in admin dashboard were changed. One part of changes is removal of intermediate "shares" part. Example - was - "/admin/shares/share_networks/" became - "/admin/share_networks/" Other part is rename of resource actions to be more alike.
ru: URL-адреса ресурсов в панели управления администратора были изменены. Часть изменений - удаление промежуточной части "файловых хранилищ". Например, было "/admin/shares/share_networks/", стало "/admin/share_networks/". Другая часть - переименование действий с ресурсами для большей схожести.

source: URLs for resources in project dashboard were changed. One part of changes is removal of intermediate "shares" part. Example - was - "/project/shares/share_networks/" became - "/project/share_networks/" Other part is rename of resource actions to be more alike.
ru: URL-адреса ресурсов в панели управления проектом были изменены. Часть изменений - удаление промежуточной части "файловых хранилищ". Например, было "/project/shares/share_networks/", стало "/project/share_networks/". Другая часть - переименование действий с ресурсами для большей схожести.

source: Updated descriptions of share migration parameters.
ru: Обновлены описания параметров переноса файлового хранилища.

source: Upgrade Notes
ru: Примечания к обновлению

source: Ussuri Series Release Notes
ru: Примечания к выпуску Ussuri

source: Victoria Series Release Notes
ru: Примечания к выпуску Victoria

source: Visibility of "switchable" fields in the share creation form involving share types that had hyphens in their names is now fixed. See `Launchpad bug #1931641 <https://launchpad.net/bugs/1931641>`_ for more details.
ru: Исправлена ​​видимость "переключаемых" полей в форме создания файлового хранилища для типов файлового хранилища, в названиях которых присутствовали дефисы. Подробнее см. в описании `ошибки Launchpad #1931641 <https://launchpad.net/bugs/1931641>`_.

source: Visibility of Set as Active button for replicas in transitional states such as Deleting and Replication Change is now fixed.
ru: Видимость кнопки 'Установить как активную' для реплик в переходных состояниях, таких как 'Удаление' и 'Изменение репликации', теперь исправлена.

source: Wallaby Series Release Notes
ru: Примечания к выпуску Wallaby

source: Xena Series Release Notes
ru: Примечания к выпуску Xena

source: Yoga Series Release Notes
ru: Примечания к выпуску Yoga

source: Zed Series Release Notes
ru: Примечания к выпуску Zed

source: `Bug #1967312 <https://launchpad.net/bugs/1967312>`_ that caused the shares dashboard to fail loading has now been fixed.
ru: `Ошибка #1967312 <https://launchpad.net/bugs/1967312>`_, приводившая к сбою загрузки панели управления файловыми хранилищами, была исправлена.

source: `Bug #1968925 <https://launchpad.net/bugs/1968925>`_ that was preventing creation of share replicas has been fixed.
ru: `Ошибка #1968925 <https://launchpad.net/bugs/1968925>`_, препятствовавшая созданию реплик файлового хранилища, была исправлена.

source: manila-ui Release Notes
ru: Примечания к выпуску manila-ui
